{"feats":[{"name":"Crossing Niagara","index":6,"rank":"emerald","description":"You and your other team member must each sit at tables spaced 5 meters apart. One team member starts with 6 meters of yarn, and a drone, the other starts with a laptop. The team member with the yarn must find a way to get one end of it to their partner, without stepping in the deadly waters of the 5 meter gap. You cannot remotely control your drone for this challenge."},{"name":"Cerberus","index":7,"rank":"ruby","description":"Create a drone guard dog. The drone should use its front sensor to watch for anyone crossing a given threshold. When it senses someone, it should alert you by taking off into the air. You can also make it beep."},{"name":"Pathfinder","index":8,"rank":"amethyst","description":"Program the drone to take off and approach an angled wall. The wall may have either of two shapes. Either way, the drone should navigate around the obstacle by detecting the wall and moving either left or right, depending on the set up."},{"name":"Eaten by Piranhas","index":9,"rank":"amethyst","description":"You’ve been hired to build a prototype for a new game show. Contestants will fly across a pit of piranhas on a big drone. While crossing a 3 meter gap, the drone should stop three times and prompt the user to answer a multiple choice trivia question. If they get all three right, it should reach the other side. Otherwise, its light should turn red and it should land immediately among the piranhas."},{"name":"Emergency Traffic Light","index":10,"rank":"amethyst","description":"You’ve been hired by the city to build an emergency traffic light that can control traffic during a power outage. Your drone should hover in place and alternate the color of its light. It should be green for 6 seconds, yellow for 2 seconds, red for 6 seconds, then back to green to continue the loop. You can set up a manual override that checks in with the user at the end of every three loops. The user should be able to type “red,” “green,” or “yellow” to change the color of the light."},{"name":"Complex Movement","index":11,"rank":"sapphire","description":"Fly your drone to a point more than 2 meters away, moving in a sine wave pattern horizontally, staying level with the floor. When it returns, trace a sine wave vertically, moving up and down."},{"name":"Skyhook","index":12,"rank":"amethyst","description":"Use a drone, yarn, and a plastic straw to manually pilot a drone to pick up a target with a paper hook on top. Move the target from one tabletop to another."},{"name":"Watcher on the Wall","index":13,"rank":"ruby","description":"Program your drone to take off, then rise slowly to peer over the top of a wall. It needs to be able to see over the top, but if it goes more than 50 centimeters higher than the top of the wall, it is exposed to attack and the challenge is failed."},{"name":"Red Light / Green Light","index":14,"rank":"ruby","description":"Program your drone to fly in a continuous circle. Every 1 second, the drone should randomly alternate between having a red light and a green light. When the light is red, it should stop and hover in place. When it’s green, it should move."},{"name":"Loon Migration","index":15,"rank":"sapphire","description":"You and your teammate must sit at tables with 2 meters of space in between them, representing a river. You must smuggle three precious dollars across the river. The partner on the east bank has: 3 dollar coins, and up to 2 meters of yarn. They must get the coins across the river, they cannot throw them. The partner on the west bank has: A laptop and a drone. If the drone lands in the river, a third person may step in to return it to the west bank. You have 8 minutes to complete the challenge once you start, and you cannot step in the river."},{"name":"Double Helix","index":16,"rank":"gold","description":"Two teams must work together for this trial. Program your drones to fly towards each other, each trailing a piece of yarn, and twist around each other in a rising double helix shape."},{"name":"Tar Pit Rescue","index":17,"rank":"amethyst","description":"You are the rescue team sent after a bus crashed into the La Brea Tar Pit. You must rescue at least one of the survivors from the pit using your drone and a paper grappling hook. The survivors are represented by paper balls in a wooden box. You can use yarn and a paper grapple."},{"name":"Vulture","index":18,"rank":"emerald","description":"Program your drone to fly in a tight circle, smaller than the one the .circle() method executes."},{"name":"Three-headed Dog","index":19,"rank":"ruby","description":"Three teams must work together for this challenge. In this advanced form of the Cerberus Trial, three teams must synchronize their drones so that they all react to a person passing by taking off, hovering for exactly 7 seconds, then landing."},{"name":"Control Panel","index":20,"rank":"ruby","description":"Write a python program that prompts the user for input. The user should be able to type the following commands and control a drone: “launch” the drone takes off “land” the drone lands “forward” the drone flies forward 100 centimeters “left,” “right,” and “backwards” the drone flies 100 centimeters in the specified direction “turn left” the drone turns 90° left. “turn right” the drone turns 90° right. “flip” makes the drone do a flip."},{"name":"Game Show Host","index":21,"rank":"amethyst","description":"Program your drone to present a number guessing game. It should think of a number between 1 and 100 then prompt the user to guess what number it’s thinking of. It should then hover in place, reacting to the user’s guesses with “gestures” -- for example rising to indicate they should guess higher, dropping to indicate they should guess lower, and flashing its lights different colors if they guess correctly."},{"name":"The Ferryman and the King","index":22,"rank":"pearl","description":"Two teams must work together for this trial. The dwarf planet Pluto and its moon Charon are tidally locked to each other. Program two drones to emulate them, orbiting each other in a continuous circle while always facing towards each other."},{"name":"Wheels of Fortune","index":23,"rank":"gold","description":"Program your drone to play a word guessing game in the style of Hangman or Wheel of Fortune. The drone should react to a right answer with a green light and a wrong answer with a red light (or different colors of your choice) When the player guesses a wrong letter, the drone should drop closer to the ground. If this happens 7 times, the drone should land and tell the player they lose. It should also tell them how many wrong guesses they have left."},{"name":"Tidal Lock","index":24,"rank":"amethyst","description":"Program your drone to emulate a tidally locked body like the moon. The drone should orbit in a continuous circle, and should always be facing the center of that circle."},{"name":"Fartraveler","index":25,"rank":"gold","description":"Program your drone to fly from one side of the room to the other. If it encounters any obstacles, it should avoid them, then continue going in the direction it was originally going. When it reaches the far side of the room, it should land. Optionally, you can try to make it measure the length of the room."},{"name":"Chameleon","index":26,"rank":"amethyst","description":"Use the green, red, purple, blue, and light blue landing pads that came with your drone. If your drone is placed on any of these color pads, it should change its LED’s color to match the landing pad. This trial does not involve flying the drone."},{"name":"Telegram","index":27,"rank":"amethyst","description":"Program your drone to send a message in morse code. It should prompt the user for a message, then translate it into morse code and send it using its LED."},{"name":"Bridge Troll","index":28,"rank":"ruby","description":"Program your drone to cross a chasm only after the user correctly answers its riddle. The riddle should be chosen at random, either from an external API, or from a .txt file containing at least three riddles."},{"name":"International Weather Balloon","index":29,"rank":"emerald","description":"The drone’s thermometer measures the internal temperature of the drone. Program your drone to print its internal temperature in both Fahrenheit and Celsius. Compare the drone’s temperature when it’s sitting still vs. when its flying. Which is hotter?"},{"name":"Rooster","index":30,"rank":"amethyst","description":"Use the datetime library. Program your drone to work as an alarm clock. The user should be able to input a time. When that time comes, the drone should make noise to wake you up."},{"name":"Polygons","index":31,"rank":"amethyst","description":"Take a user input of a number higher than 2. Program your drone to fly in the path of a regular polygon with that number of sides. For example, 3 should make the drone fly in a triangle. 4 should make it fly in a square. If the user puts in an invalid input, tell them that and allow them to try again."},{"name":"WASD","index":32,"rank":"pearl","description":"Use the keyboard library. Program your drone so that you can control it with the W, A, S, and D keys on your keyboard. It’s up to you how the controls work. You should also include some method of changing the drone’s altitude."},{"name":"WASD Race","index":33,"rank":"gold","description":"After solving the WASD drone trial, create a program that allows a user to fly the drone for 60 seconds. After 50 seconds, the drone should beep and flash red with increasing speed to let the user know their time is almost up. After 60 seconds, the drone should land."},{"name":"Copycat","index":34,"rank":"onyx","description":"After solving the WASD drone trial, create a program that allows a user to move the drone freely, then land. After they land, the drone should be able to take off again and automatically repeat whatever movements they just made."},{"name":"Flight Zone","index":35,"rank":"pearl","description":"After solving the WASD drone trial, write a program that allows the user to control the drone, but only within a limited zone of about 1 meter by 2 meters, or a little bigger than one of these tables. If the user tries to fly the drone out of the flight zone, it should automatically turn around and return to the zone."},{"name":"Reinvent the Wheel","index":36,"rank":"gold","description":""}],"dronePilots":{"cardboard box":{"pilots":["Miles","Adi"],"feats":[9,12,7,10,14,8,11,13,19,27,2,30,31,32,33,22,36,26,20,24]},"Achoo":{"pilots":["Ahmad","Abdullah"],"feats":[9,12,8,10,7,13,14,18,24,21,19,26,27,29,30,16]},"DAdrone":{"pilots":["Adam","Tobi"],"feats":[9,10,12,7,15,18,24,11,26,27,13,20,29,30,32,16]},"Cloudrider":{"pilots":["Sam","Kiran"],"feats":[9,12,10,15,7,8,13,17,18,11,20,14,21,19,26,27,23,25,29,30,31,36,22,28]},"Boeing":{"pilots":["Miles","Ahmad"],"feats":[6,7]},"Arnold Palmer":{"pilots":["Abdullah","Kiran"],"feats":[6]},"Ragingriver":{"pilots":["Adi","Tobi"],"feats":[6]},"Obi-Wan Droneobi":{"pilots":["Adam","Sam"],"feats":[6]}}}